/*
 * @Author: 星必尘Sguan
 * @GitHub: https://github.com/Sguan-ZhouQing
 * @Date: 2026-04-29 19:43:41
 * @LastEditors: 星必尘Sguan|3464647102@qq.com
 * @LastEditTime: 2026-04-30 01:57:22
 * @FilePath: \SguanFOC_Debug\SguanFOC\Sguan_HFI.c
 * @Description: SguanFOC库的“HFI无感高频注入算法(高频脉振正弦波)”实现
 * 
 * Copyright (c) 2026 by $星必尘Sguan, All Rights Reserved. 
 */
#include "Sguan_HFI.h"

#define Value_PI_2          1.570796326794896f      // 二分之一pi
// 快速正余弦求解float版本
static float fast_sin(float x);
#define fast_cos(x) fast_sin(Value_PI_2 - x);
static void fast_sin_cos(float x, float *sin_x, float *cos_x);
// 角度生成器
static void Value_Rad_Loop(float *angle, float Rad_s, float T);

// 常量宏定义声明
#define Value_512_2PI       81.487330863050417f
#define Value_2PI           6.283185307179586f      // 2pi的数值
static float Value_normalize(float angle);

// 参数取模[0, 2π)
static float Value_normalize(float angle){
    while (1){
        if (angle > Value_2PI)
            angle -= Value_2PI;
        else if (angle < 0)
            angle += Value_2PI;
        else
            break;
    }
    return angle;
}

// 查表法求得float的角度正余弦值
static const float sin_tab[512] = {
    0.0000000000f, 0.0122715384f, 0.0245412290f, 0.0368072242f, 0.0490676761f, 0.0613207407f,
    0.0735645667f, 0.0857973173f, 0.0980171412f, 0.1102222055f, 0.1224106774f, 0.1345807165f,
    0.1467304677f, 0.1588581502f, 0.1709619015f, 0.1830398887f, 0.1950903237f, 0.2071113884f,
    0.2191012353f, 0.2310581207f, 0.2429801971f, 0.2548656762f, 0.2667127848f, 0.2785196900f,
    0.2902846634f, 0.3020059466f, 0.3136817515f, 0.3253103197f, 0.3368898630f, 0.3484186828f,
    0.3598950505f, 0.3713172078f, 0.3826834559f, 0.3939920664f, 0.4052413404f, 0.4164295793f,
    0.4275550842f, 0.4386162460f, 0.4496113360f, 0.4605387151f, 0.4713967443f, 0.4821837544f,
    0.4928982258f, 0.5035383701f, 0.5141027570f, 0.5245897174f, 0.5349976420f, 0.5453249812f,
    0.5555702448f, 0.5657318234f, 0.5758082271f, 0.5857979059f, 0.5956993103f, 0.6055110097f,
    0.6152316332f, 0.6248595119f, 0.6343933344f, 0.6438315511f, 0.6531728506f, 0.6624158025f,
    0.6715589762f, 0.6806010008f, 0.6895405650f, 0.6983762980f, 0.7071067691f, 0.7157308459f,
    0.7242470980f, 0.7326542735f, 0.7409511805f, 0.7491363883f, 0.7572088838f, 0.7651672959f,
    0.7730104327f, 0.7807372808f, 0.7883464098f, 0.7958369255f, 0.8032075167f, 0.8104571700f,
    0.8175848126f, 0.8245893121f, 0.8314696550f, 0.8382247090f, 0.8448535800f, 0.8513551950f,
    0.8577286601f, 0.8639728427f, 0.8700869679f, 0.8760701418f, 0.8819212914f, 0.8876396418f,
    0.8932242990f, 0.8986744881f, 0.9039893150f, 0.9091680050f, 0.9142097831f, 0.9191138744f,
    0.9238795042f, 0.9285060763f, 0.9329928160f, 0.9373390079f, 0.9415440559f, 0.9456073642f,
    0.9495282173f, 0.9533060193f, 0.9569403529f, 0.9604305625f, 0.9637760520f, 0.9669764638f,
    0.9700312614f, 0.9729399681f, 0.9757021070f, 0.9783173800f, 0.9807853103f, 0.9831054807f,
    0.9852776527f, 0.9873014092f, 0.9891765118f, 0.9909026623f, 0.9924795628f, 0.9939069748f,
    0.9951847196f, 0.9963126183f, 0.9972904325f, 0.9981181026f, 0.9987954497f, 0.9993224144f,
    0.9996988177f, 0.9999247193f, 1.0000000000f, 0.9999247193f, 0.9996988177f, 0.9993223548f,
    0.9987954497f, 0.9981181026f, 0.9972904325f, 0.9963126183f, 0.9951847196f, 0.9939069748f,
    0.9924795032f, 0.9909026027f, 0.9891765118f, 0.9873014092f, 0.9852776527f, 0.9831054807f,
    0.9807852507f, 0.9783173800f, 0.9757021070f, 0.9729399085f, 0.9700312614f, 0.9669764638f,
    0.9637760520f, 0.9604305029f, 0.9569402933f, 0.9533060193f, 0.9495281577f, 0.9456073046f,
    0.9415440559f, 0.9373389482f, 0.9329928160f, 0.9285060763f, 0.9238795042f, 0.9191138744f,
    0.9142097235f, 0.9091680050f, 0.9039893150f, 0.8986744285f, 0.8932242990f, 0.8876395822f,
    0.8819212317f, 0.8760700226f, 0.8700870275f, 0.8639728427f, 0.8577286005f, 0.8513551354f,
    0.8448535204f, 0.8382246494f, 0.8314695358f, 0.8245893121f, 0.8175848126f, 0.8104571700f,
    0.8032075167f, 0.7958368659f, 0.7883463502f, 0.7807371020f, 0.7730104923f, 0.7651672363f,
    0.7572088242f, 0.7491363287f, 0.7409510612f, 0.7326541543f, 0.7242469788f, 0.7157308459f,
    0.7071067691f, 0.6983762383f, 0.6895405054f, 0.6806009412f, 0.6715588570f, 0.6624156237f,
    0.6531728506f, 0.6438315511f, 0.6343932748f, 0.6248594522f, 0.6152315140f, 0.6055109501f,
    0.5956991315f, 0.5857978463f, 0.5758081675f, 0.5657317638f, 0.5555701852f, 0.5453248620f,
    0.5349974632f, 0.5245895386f, 0.5141027570f, 0.5035383701f, 0.4928981364f, 0.4821836948f,
    0.4713966250f, 0.4605385661f, 0.4496113658f, 0.4386162460f, 0.4275550544f, 0.4164294899f,
    0.4052412212f, 0.3939919174f, 0.3826832771f, 0.3713172376f, 0.3598950505f, 0.3484186530f,
    0.3368898034f, 0.3253102005f, 0.3136816025f, 0.3020057976f, 0.2902847230f, 0.2785196900f,
    0.2667127252f, 0.2548655868f, 0.2429800779f, 0.2310579717f, 0.2191010714f, 0.2071114033f,
    0.1950903088f, 0.1830398440f, 0.1709618121f, 0.1588580310f, 0.1467303336f, 0.1345805228f,
    0.1224106997f, 0.1102221981f, 0.0980170965f, 0.0857972279f, 0.0735644475f, 0.0613205843f,
    0.0490674861f, 0.0368072391f, 0.0245412104f, 0.0122714853f, -0.0000000874f, -0.0122716604f,
    -0.0245413855f, -0.0368074141f, -0.0490676612f, -0.0613207594f, -0.0735646188f, -0.0857974067f,
    -0.0980172679f, -0.1102223694f, -0.1224108711f, -0.1345807016f, -0.1467304975f, -0.1588582098f,
    -0.1709619910f, -0.1830400229f, -0.1950904876f, -0.2071115673f, -0.2191012353f, -0.2310581356f,
    -0.2429802418f, -0.2548657656f, -0.2667129040f, -0.2785198689f, -0.2902848721f, -0.3020059466f,
    -0.3136817813f, -0.3253103495f, -0.3368899524f, -0.3484188020f, -0.3598951995f, -0.3713173866f,
    -0.3826834261f, -0.3939920664f, -0.4052414000f, -0.4164296687f, -0.4275552332f, -0.4386163950f,
    -0.4496115148f, -0.4605387151f, -0.4713967741f, -0.4821838439f, -0.4928982854f, -0.5035384893f,
    -0.5141028762f, -0.5245896578f, -0.5349976420f, -0.5453250408f, -0.5555703044f, -0.5657318830f,
    -0.5758083463f, -0.5857980251f, -0.5956993103f, -0.6055110693f, -0.6152316332f, -0.6248595715f,
    -0.6343933940f, -0.6438316703f, -0.6531729698f, -0.6624158025f, -0.6715589762f, -0.6806010604f,
    -0.6895406246f, -0.6983763576f, -0.7071068883f, -0.7157309651f, -0.7242470980f, -0.7326542735f,
    -0.7409511805f, -0.7491364479f, -0.7572087646f, -0.7651672363f, -0.7730104327f, -0.7807372212f,
    -0.7883464694f, -0.7958369255f, -0.8032075763f, -0.8104572892f, -0.8175849319f, -0.8245894313f,
    -0.8314697742f, -0.8382248878f, -0.8448537588f, -0.8513553739f, -0.8577285409f, -0.8639728427f,
    -0.8700869679f, -0.8760700822f, -0.8819212914f, -0.8876396418f, -0.8932243586f, -0.8986745477f,
    -0.9039893746f, -0.9091680646f, -0.9142098427f, -0.9191139936f, -0.9238796830f, -0.9285060167f,
    -0.9329927564f, -0.9373390079f, -0.9415440559f, -0.9456073046f, -0.9495282173f, -0.9533060789f,
    -0.9569403529f, -0.9604305625f, -0.9637761116f, -0.9669765234f, -0.9700313210f, -0.9729400277f,
    -0.9757022262f, -0.9783173203f, -0.9807852507f, -0.9831054807f, -0.9852776527f, -0.9873014092f,
    -0.9891765118f, -0.9909026623f, -0.9924795628f, -0.9939069748f, -0.9951847196f, -0.9963126183f,
    -0.9972904921f, -0.9981181026f, -0.9987954497f, -0.9993223548f, -0.9996988177f, -0.9999247193f,
    -1.0000000000f, -0.9999247193f, -0.9996988177f, -0.9993223548f, -0.9987954497f, -0.9981181026f,
    -0.9972904325f, -0.9963126183f, -0.9951847196f, -0.9939069152f, -0.9924795032f, -0.9909026623f,
    -0.9891765118f, -0.9873014092f, -0.9852776527f, -0.9831054807f, -0.9807852507f, -0.9783173203f,
    -0.9757021070f, -0.9729399085f, -0.9700312018f, -0.9669764042f, -0.9637759924f, -0.9604304433f,
    -0.9569402337f, -0.9533060789f, -0.9495282173f, -0.9456073046f, -0.9415440559f, -0.9373390079f,
    -0.9329927564f, -0.9285060167f, -0.9238794446f, -0.9191137552f, -0.9142096639f, -0.9091678858f,
    -0.9039891362f, -0.8986743093f, -0.8932241201f, -0.8876396418f, -0.8819212914f, -0.8760700822f,
    -0.8700869679f, -0.8639728427f, -0.8577285409f, -0.8513551354f, -0.8448534608f, -0.8382245898f,
    -0.8314694762f, -0.8245891333f, -0.8175846338f, -0.8104569912f, -0.8032075763f, -0.7958369255f,
    -0.7883464098f, -0.7807372212f, -0.7730104327f, -0.7651672363f, -0.7572087646f, -0.7491362691f,
    -0.7409510016f, -0.7326540947f, -0.7242469192f, -0.7157306075f, -0.7071065307f, -0.6983759999f,
    -0.6895406246f, -0.6806010008f, -0.6715589762f, -0.6624157429f, -0.6531727910f, -0.6438314915f,
    -0.6343931556f, -0.6248593330f, -0.6152314544f, -0.6055108309f, -0.5956990719f, -0.5857976079f,
    -0.5758079290f, -0.5657315254f, -0.5555703044f, -0.5453250408f, -0.5349976420f, -0.5245896578f,
    -0.5141026974f, -0.5035383105f, -0.4928980768f, -0.4821836054f, -0.4713965356f, -0.4605384767f,
    -0.4496110678f, -0.4386159480f, -0.4275547862f, -0.4164292216f, -0.4052413702f, -0.3939920664f,
    -0.3826834261f, -0.3713171482f, -0.3598949611f, -0.3484185636f, -0.3368897140f, -0.3253101110f,
    -0.3136815429f, -0.3020057082f, -0.2902843952f, -0.2785193622f, -0.2667123973f, -0.2548652887f,
    -0.2429802269f, -0.2310581207f, -0.2191012204f, -0.2071113139f, -0.1950902343f, -0.1830397546f,
    -0.1709617227f, -0.1588579416f, -0.1467302442f, -0.1345804483f, -0.1224103719f, -0.1102218702f,
    -0.0980167687f, -0.0857969075f, -0.0735645965f, -0.0613207370f, -0.0490676388f, -0.0368071534f,
    -0.0245411228f, -0.0122713987f
};

// 快速正弦算法sine
static float fast_sin(float theta){
    while (1){
        if (theta > Value_2PI)
            theta = theta - Value_2PI;
        else if (theta < 0)
            theta = theta + Value_2PI;
        else
            break;
    }
    float idx_f = theta * Value_512_2PI;
    int idx = (int)idx_f;
    
    if (idx >= 512) idx = 511;
    if (idx < 0) idx = 0;
    return sin_tab[idx];
}

// 快速求解sine和cosine
static void fast_sin_cos(float x, float *sin_x, float *cos_x){
  *sin_x = fast_sin(x);
  *cos_x = fast_cos(x);
}

// 电机角度积分函数
static void Value_Rad_Loop(float *angle, float Rad_s, float T){
    *angle = *angle + Rad_s*T;
    *angle = Value_normalize(*angle);
}

/**
 * @description: 无感高频方波注入的初始化函数
 * @param {SMO_STRUCT} *smo
 * @return {*}
 */
void HFI_Init(HFI_STRUCT *hfi){
    // 1.陷波传递函数中间参数的初始化设置
    double temp0 = ((double)hfi->T)*((double)hfi->Wo)*((double)hfi->K1);
    double temp1 = ((double)hfi->T)*((double)hfi->Wo)*((double)hfi->K2);
    double temp2 = ((double)hfi->T)*((double)hfi->Wo)*
                ((double)hfi->T)*((double)hfi->Wo);
    double den1 = 4.0+4.0*temp0+temp2;
    double den2 = 4.0+8.0*temp0+4.0*temp2;

    hfi->go.s1_num[0] = (float)((4.0+4.0*temp1+temp2)/den1);
    hfi->go.s1_num[1] = (float)((-8.0+2.0*temp2+4.0)/den1);
    hfi->go.s1_num[2] = (float)((4.0-4.0*temp1+temp2)/den1);
    hfi->go.s1_den = (float)((4.0-4.0*temp0+temp2)/den1);

    hfi->go.s2_num[0] = (float)((4.0+8.0*temp1+4.0*temp2)/den2);
    hfi->go.s2_num[1] = (float)((-8.0+8.0*temp2+4.0)/den2);
    hfi->go.s2_num[2] = (float)((4.0-8.0*temp1+4.0*temp2)/den2);
    hfi->go.s2_den = (float)((4.0-8.0*temp0+4.0*temp2)/den2);

    // 2.初始化陷波历史数值
    hfi->data0.x_i[0] = 0.0f;
    hfi->data0.x_i[1] = 0.0f;
    hfi->data0.x_o[0] = 0.0f;
    hfi->data0.x_o[1] = 0.0f;

    hfi->data0.y_i[0] = 0.0f;
    hfi->data0.y_i[1] = 0.0f;
    hfi->data0.y_o[0] = 0.0f;
    hfi->data0.y_o[1] = 0.0f;

    hfi->data1.y_i[0] = 0.0f;
    hfi->data1.y_i[1] = 0.0f;
    hfi->data1.y_o[0] = 0.0f;
    hfi->data1.y_o[1] = 0.0f;

    // 3.初始化陷波输入输出
    hfi->go.Input_Id = 0.0f;
    hfi->go.Input_Iq = 0.0f;
    hfi->go.Output_Id = 0.0f;
    hfi->go.Output_Iq = 0.0f;

    // 4.带通传递函数中间参数的初始化设置
    double p_temp1 = ((double)hfi->T)*((double)hfi->Wo)*(((double)hfi->zeta)*4.0);
    double p_temp2 = ((double)hfi->T)*((double)hfi->Wo)*
                    ((double)hfi->T)*((double)hfi->Wo);

    double den = p_temp2+p_temp1+4.0;

    hfi->go.p_num = (float)(p_temp1/den);
    hfi->go.p_den[0] = (float)((-8.0+2.0*p_temp2)/den);
    hfi->go.p_den[1] = (float)((p_temp2-p_temp1+4.0)/den);

    // 5.初始化带通历史数值
    hfi->data0.x_i[0] = 0.0f;
    hfi->data0.x_i[1] = 0.0f;
    hfi->data0.x_o[0] = 0.0f;
    hfi->data0.x_o[1] = 0.0f;

    
    // 6.初始化带通输入输出
    hfi->go.Input_Q = 0.0f;
    hfi->go.Output_Q = 0.0f;

    // 7.初始化注入电压值及其余
    hfi->go.Output_Uin = 0.0f;
    hfi->go.Angle = 0.0f;
}

/**
 * @description: 无感高频方波注入的离散运行函数
 * @reminder: (处理DQ轴电流环的基频信号量)
 * @reminder: https://github.com/Sguan-ZhouQing/SguanFOC_Library/blob/main/%E9%85%8D%E5%A5%97Simulink%E6%A8%A1%E5%9E%8B%E5%BC%80%E6%BA%90%E2%91%A1%5B%E7%AE%97%E6%B3%95%E5%8E%9F%E7%90%86%E5%9B%BE%5D/Sguan_HFI.png
 * @reminder: (上方链接是此Sguan_HFI模块Simulink原理仿真图)
 * @param {HFI_STRUCT} *hfi
 * @return {*}
 */
void HFI_Current_Loop(HFI_STRUCT *hfi){
    // 1.带入差分方程，计算输出
    hfi->go.Output_Id = hfi->go.s1_num[0]*hfi->go.Input_Id + 
                        hfi->go.s1_num[1]*(hfi->data0.x_i[0]-hfi->data0.x_o[0]) + 
                        hfi->go.s1_num[2]*hfi->data0.x_i[1] - 
                        hfi->go.s1_den*hfi->data0.x_o[1];

    hfi->go.Output_Iq = hfi->go.s1_num[0]*hfi->go.Input_Iq + 
                        hfi->go.s1_num[1]*(hfi->data0.y_i[0]-hfi->data0.y_o[0]) + 
                        hfi->go.s1_num[2]*hfi->data0.y_i[1] - 
                        hfi->go.s1_den*hfi->data0.y_o[1];

    // 2.更新历史输入和输出数值
    hfi->data0.x_i[1] = hfi->data0.x_i[0];
    hfi->data0.x_i[0] = hfi->go.Input_Id;
    hfi->data0.x_o[1] = hfi->data0.x_o[0];
    hfi->data0.x_o[0] = hfi->go.Output_Id;

    hfi->data0.y_i[1] = hfi->data0.y_i[0];
    hfi->data0.y_i[0] = hfi->go.Input_Iq;
    hfi->data0.y_o[1] = hfi->data0.y_o[0];
    hfi->data0.y_o[0] = hfi->go.Output_Iq;
}

/**
 * @description: 无感高频方波注入的离散运行函数
 * @reminder: (处理静止坐标系下的高频信号)
 * @reminder: https://github.com/Sguan-ZhouQing/SguanFOC_Library/blob/main/%E9%85%8D%E5%A5%97Simulink%E6%A8%A1%E5%9E%8B%E5%BC%80%E6%BA%90%E2%91%A1%5B%E7%AE%97%E6%B3%95%E5%8E%9F%E7%90%86%E5%9B%BE%5D/Sguan_HFI.png
 * @reminder: (上方链接是此Sguan_HFI模块Simulink原理仿真图)
 * @param {HFI_STRUCT} *hfi
 * @return {*}
 */
void HFI_ReadRad_Loop(HFI_STRUCT *hfi){
    // 1.带通滤波，得到高频电流分量
    hfi->go.High = hfi->go.p_num*(hfi->go.Input_Q - hfi->data1.x_i[1]) - 
                        hfi->go.p_den[0]*hfi->data1.x_o[0] - 
                        hfi->go.p_den[1]*hfi->data1.x_o[1];

    // 2.更新历史输入和输出数值
    hfi->data1.x_i[1] = hfi->data1.x_i[0];
    hfi->data1.x_i[0] = hfi->go.Input_Q;
    hfi->data1.x_o[1] = hfi->data1.x_o[0];
    hfi->data1.x_o[0] = hfi->go.High;

    // 3.同频相乘，得到待解调的高频量
    float TPNF_in = hfi->go.High*hfi->h*hfi->go.Sine[1];

    // 4.陷波滤波，滤除二倍高频分量
    hfi->go.Output_Q = hfi->go.s2_num[0]*TPNF_in + 
                        hfi->go.s2_num[1]*(hfi->data1.y_i[0]-hfi->data1.y_o[0]) + 
                        hfi->go.s2_num[2]*hfi->data1.y_i[1] - 
                        hfi->go.s2_den*hfi->data1.y_o[1];

    // 5.更新历史输入和输出数值
    hfi->data1.y_i[1] = hfi->data1.y_i[0];
    hfi->data1.y_i[0] = TPNF_in;
    hfi->data1.y_o[1] = hfi->data1.y_o[0];
    hfi->data1.y_o[0] = hfi->go.Output_Q;
    hfi->go.Sine[1] = hfi->go.Sine[0];

    // 6.刷新注入信号
    Value_Rad_Loop(&hfi->go.Angle, hfi->Wo, hfi->T);
    float Cosine;
    fast_sin_cos(hfi->go.Angle, &hfi->go.Sine[0], &Cosine);
    hfi->go.Output_Uin = Cosine*hfi->Uh;
}

HFI_STRUCT HFI;

void H_Init(void){
    HFI.T = 1e-4;
    HFI.Wo = 62832/3.0;
    HFI.h = 2.0f;
    HFI.Uh = 30.0f;
    HFI.K1 = 0.3;
    HFI.K2 = 0.0;
    HFI.zeta = 0.2;
    HFI_Init(&HFI);
}

void H_Current_Loop(float Id,float Iq,float *Id_out,float *Iq_out){
    HFI.go.Input_Id = Id;
    HFI.go.Input_Iq = Iq;
    HFI_Current_Loop(&HFI);
    *Id_out = HFI.go.Output_Id;
    *Iq_out = HFI.go.Output_Iq;
}

void H_Rad_Loop(float Q,float *Q_out,float *cos){
    HFI.go.Input_Q = Q;
    HFI_ReadRad_Loop(&HFI);
    *Q_out = HFI.go.Output_Q;
    *cos = HFI.go.Output_Uin;
}
